-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th4 27, 2023 lúc 11:26 AM
-- Phiên bản máy phục vụ: 10.4.27-MariaDB
-- Phiên bản PHP: 8.1.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `pbl5`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `hr`
--

CREATE TABLE `hr` (
  `id` int(11) NOT NULL,
  `hr_values` varchar(100) NOT NULL,
  `hr_mean` float NOT NULL,
  `time_start` datetime NOT NULL,
  `time_end` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `hr`
--

INSERT INTO `hr` (`id`, `hr_values`, `hr_mean`, `time_start`, `time_end`) VALUES
(24, '75,45,97,44,54,60,53,145,89,60,72,140,42,115,116,50,146,114,132,88,137,90,96,78,45,50,64,78,43,141', 85.3, '2023-04-27 11:30:11', '2023-04-27 11:30:21'),
(25, '74,112,76,104,81,116,115,96,86,126,90,139,84,103,113,100,100,79,117,106,57,41,57,40,126,138,129,107,', 96.1, '2023-04-27 11:30:24', '2023-04-27 11:30:34'),
(26, '41,75,75,128,116,56,133,75,121,131,42,116,67,81,91,120,63,137,53,127,53,65,97,97,59,70,141,93,55,119', 89.9, '2023-04-27 11:47:19', '2023-04-27 11:47:29'),
(27, '47,127,131,99,121,115,108,130,121,69,127,96,120,72,40,43,78,75,68,92,54,100,74,114,109,109,118,57,88', 92.7333, '2023-04-27 11:47:31', '2023-04-27 11:47:41'),
(28, '138,82,81,41,91,62,98,74,132,71,84,47,96,54,143,47,149,56,126,61,136,132,138,149,127,85,144,129,134,', 99.4, '2023-04-27 11:47:43', '2023-04-27 11:47:53'),
(29, '138,73,49,94,99,46,68,77,118,41,83,81,112,107,146,66,131,65,88,50,104,97,49,92,59,121,130,93,40,71', 86.2667, '2023-04-27 11:47:55', '2023-04-27 11:48:05'),
(30, '141,70,117,104,99,81,134,140,93,113,122,61,40,62,129,103,150,78,126,46,115,57,141,40,130,40,100,68,1', 97.2, '2023-04-27 14:08:08', '2023-04-27 14:08:18'),
(31, '78,105,82,132,77,69,92,106,148,99,59,130,85,70,67,76,142,134,123,113,124,115,46,110,144,98,126,139,4', 99.8667, '2023-04-27 14:08:21', '2023-04-27 14:08:31'),
(32, '104,102,102,61,127,75,135,142,49,105,80,42,84,107,84,144,126,98,115,90,55,47,119,146,87,45,103,54,99', 94.0667, '2023-04-27 14:08:33', '2023-04-27 14:08:43'),
(33, '87,145,83,68,84,54,88,80,45,135,93,99,56,111,124,71,65,150,43,149,89,101,145,75,48,115,89,129,137,86', 94.8, '2023-04-27 14:08:45', '2023-04-27 14:08:55'),
(34, '129,46,136,85,72,71,144,56,146,119,142,93,120,144,129,107,88,66,56,57,62,43,41,55,144,139,147,83,45,', 97.1, '2023-04-27 14:08:57', '2023-04-27 14:09:07'),
(35, '120,46,130,146,149,129,149,48,144,42,144,124,73,110,108,96,63,70,121,71,92,107,123,93,134,49,49,135,', 100, '2023-04-27 14:09:10', '2023-04-27 14:09:20'),
(36, '67,84,105,108,102,137,41,47,75,47,122,141,68,92,133,91,126,51,86,146,146,44,142,67,86,120,61,93,116,', 95.2333, '2023-04-27 14:09:22', '2023-04-27 14:09:32'),
(37, '88,55,84,84,120,147,139,45,77,91,82,64,91,113,86,116,49,41,58,94,106,118,145,76,64,52,88,142,91,110', 90.5333, '2023-04-27 14:09:34', '2023-04-27 14:09:44'),
(38, '139,72,94,43,104,76,90,57,123,140,127,74,97,53,69,130,58,55,60,100,111,134,128,111,118,82,92,84,45,8', 91.7333, '2023-04-27 14:09:46', '2023-04-27 14:09:56');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `predict`
--

CREATE TABLE `predict` (
  `id` int(11) NOT NULL,
  `result` varchar(100) NOT NULL,
  `posting_time` datetime NOT NULL,
  `hr_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `predict`
--

INSERT INTO `predict` (`id`, `result`, `posting_time`, `hr_id`) VALUES
(23, 'No Stress', '2023-04-27 11:30:13', 24),
(24, 'No Stress', '2023-04-27 11:30:26', 25),
(25, 'No Stress', '2023-04-27 11:47:21', 26),
(26, 'No Stress', '2023-04-27 11:47:33', 27),
(27, 'No Stress', '2023-04-27 11:47:45', 28),
(28, 'No Stress', '2023-04-27 11:47:57', 29),
(29, 'No Stress', '2023-04-27 14:08:10', 30),
(30, 'No Stress', '2023-04-27 14:08:23', 31),
(31, 'No Stress', '2023-04-27 14:08:35', 32),
(32, 'No Stress', '2023-04-27 14:08:47', 33),
(33, 'No Stress', '2023-04-27 14:08:59', 34),
(34, 'No Stress', '2023-04-27 14:09:12', 35),
(35, 'No Stress', '2023-04-27 14:09:24', 36),
(36, 'No Stress', '2023-04-27 14:09:36', 37),
(37, 'No Stress', '2023-04-27 14:09:48', 38);

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `hr`
--
ALTER TABLE `hr`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `predict`
--
ALTER TABLE `predict`
  ADD PRIMARY KEY (`id`),
  ADD KEY `hr_id` (`hr_id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `hr`
--
ALTER TABLE `hr`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT cho bảng `predict`
--
ALTER TABLE `predict`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `predict`
--
ALTER TABLE `predict`
  ADD CONSTRAINT `predict_ibfk_1` FOREIGN KEY (`hr_id`) REFERENCES `hr` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
